In [9]:
# To use pandas for the Clean and transform the raw dataset
import pandas as pd

#To Read the csv file
df=pd.read_csv("customer_shopping_behavior.csv")

In [10]:
#To print First or Top 5 records from the dataset
#To check the structure of the dataset

df.head()

,Customer ID,Age,Gender,Item Purchased,Category,Purchase Amount (USD),Location,Size,Color,Season,Review Rating,Subscription Status,Shipping Type,Discount Applied,Promo Code Used,Previous Purchases,Payment Method,Frequency of Purchases
0,1,55,Male,Blouse,Clothing,53,Kentucky,L,Gray,Winter,3.1,Yes,Express,Yes,Yes,14,Venmo,Fortnightly
1,2,19,Male,Sweater,Clothing,64,Maine,L,Maroon,Winter,3.1,Yes,Express,Yes,Yes,2,Cash,Fortnightly
2,3,50,Male,Jeans,Clothing,73,Massachusetts,S,Maroon,Spring,3.1,Yes,Free Shipping,Yes,Yes,23,Credit Card,Weekly
3,4,21,Male,Sandals,Footwear,90,Rhode Island,M,Maroon,Spring,3.5,Yes,Next Day Air,Yes,Yes,49,PayPal,Weekly
4,5,45,Male,Blouse,Clothing,49,Oregon,M,Turquoise,Spring,2.7,Yes,Free Shipping,Yes,Yes,31,PayPal,Annually

In [12]:
#To know the how many rows and 
#To chcek the how many columns are in the data set 
#To know the datatypes of the columns

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3900 entries, 0 to 3899
Data columns (total 18 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Customer ID             3900 non-null   int64
 1   Age                     3900 non-null   int64
 2   Gender                  3900 non-null   object
 3   Item Purchased          3900 non-null   object
 4   Category                3900 non-null   object
 5   Purchase Amount (USD)   3900 non-null   int64
 6   Location                3900 non-null   object
 7   Size                    3900 non-null   object
 8   Color                   3900 non-null   object
 9   Season                  3900 non-null   object
 10  Review Rating           3863 non-null   float64
 11  Subscription Status     3900 non-null   object
 12  Shipping Type           3900 non-null   object
 13  Discount Applied        3900 non-null   object
 14  Promo Code Used         3900 non-null   object
 15  Previous Purchases      3900 non-null   int64
 16  Payment Method          3900 non-null   object
 17  Frequency of Purchases  3900 non-null   object
dtypes: float64(1), int64(4), object(13)
memory usage: 548.6+ KB

In [15]:
# To Chcek the summary of the statastics of all the columns 
# Like count,max,min,mean,25%,50%,75% etc.....

df.describe()

,Customer ID,Age,Purchase Amount (USD),Review Rating,Previous Purchases
count,3900.000000,3900.000000,3900.000000,3863.000000,3900.000000
mean,1950.500000,44.068462,59.764359,3.750065,25.351538
std,1125.977353,15.207589,23.685392,0.716983,14.447125
min,1.000000,18.000000,20.000000,2.500000,1.000000
25%,975.750000,31.000000,39.000000,3.100000,13.000000
50%,1950.500000,44.000000,60.000000,3.800000,25.000000
75%,2925.250000,57.000000,81.000000,4.400000,38.000000
max,3900.000000,70.000000,100.000000,5.000000,50.000000

In [17]:
# To get the summary of the both numeric and categorical columns

df.describe(include='all')

,Customer ID,Age,Gender,Item Purchased,Category,Purchase Amount (USD),Location,Size,Color,Season,Review Rating,Subscription Status,Shipping Type,Discount Applied,Promo Code Used,Previous Purchases,Payment Method,Frequency of Purchases
count,3900.000000,3900.000000,3900,3900,3900,3900.000000,3900,3900,3900,3900,3863.000000,3900,3900,3900,3900,3900.000000,3900,3900
unique,NaN,NaN,2,25,4,NaN,50,4,25,4,NaN,2,6,2,2,NaN,6,7
top,NaN,NaN,Male,Blouse,Clothing,NaN,Montana,M,Olive,Spring,NaN,No,Free Shipping,No,No,NaN,PayPal,Every 3 Months
freq,NaN,NaN,2652,171,1737,NaN,96,1755,177,999,NaN,2847,675,2223,2223,NaN,677,584
mean,1950.500000,44.068462,NaN,NaN,NaN,59.764359,NaN,NaN,NaN,NaN,3.750065,NaN,NaN,NaN,NaN,25.351538,NaN,NaN
std,1125.977353,15.207589,NaN,NaN,NaN,23.685392,NaN,NaN,NaN,NaN,0.716983,NaN,NaN,NaN,NaN,14.447125,NaN,NaN
min,1.000000,18.000000,NaN,NaN,NaN,20.000000,NaN,NaN,NaN,NaN,2.500000,NaN,NaN,NaN,NaN,1.000000,NaN,NaN
25%,975.750000,31.000000,NaN,NaN,NaN,39.000000,NaN,NaN,NaN,NaN,3.100000,NaN,NaN,NaN,NaN,13.000000,NaN,NaN
50%,1950.500000,44.000000,NaN,NaN,NaN,60.000000,NaN,NaN,NaN,NaN,3.800000,NaN,NaN,NaN,NaN,25.000000,NaN,NaN
75%,2925.250000,57.000000,NaN,NaN,NaN,81.000000,NaN,NaN,NaN,NaN,4.400000,NaN,NaN,NaN,NaN,38.000000,NaN,NaN
max,3900.000000,70.000000,NaN,NaN,NaN,100.000000,NaN,NaN,NaN,NaN,5.000000,NaN,NaN,NaN,NaN,50.000000,NaN,NaN

In [19]:
# To check the the missing values Present in the columns

df.isnull().sum()

Customer ID                0
Age                        0
Gender                     0
Item Purchased             0
Category                   0
Purchase Amount (USD)      0
Location                   0
Size                       0
Color                      0
Season                     0
Review Rating             37
Subscription Status        0
Shipping Type              0
Discount Applied           0
Promo Code Used            0
Previous Purchases         0
Payment Method             0
Frequency of Purchases     0
dtype: int64

In [21]:
# To remove the null values from the columns..
# i.e Review Rating(Column having 37 null value)

df['Review Rating'] = df.groupby('Category')['Review Rating'].transform(lambda x:x.fillna(x.median()))

In [22]:
# To check the the missing values Present in the columns

df.isnull().sum()

Customer ID               0
Age                       0
Gender                    0
Item Purchased            0
Category                  0
Purchase Amount (USD)     0
Location                  0
Size                      0
Color                     0
Season                    0
Review Rating             0
Subscription Status       0
Shipping Type             0
Discount Applied          0
Promo Code Used           0
Previous Purchases        0
Payment Method            0
Frequency of Purchases    0
dtype: int64

In [30]:
#To convert the column names into lower case.
df.columns= df.columns.str.lower()

#To replace the space between the column names words into the underscore.
df.columns = df.columns.str.replace(' ','_')

#to replace the name of the column to new name 
# i.e ( purchase_amount_(usd)':'purchase_amount' )
df = df.rename(columns={'purchase_amount_(usd)':'purchase_amount'})

In [31]:
#To check the columns are converted into the snake case or not ....
# snake case means  (ex 1. customer_id )

df.columns

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'promo_code_used', 'previous_purchases',
       'payment_method', 'frequency_of_purchases'],
      dtype='object')

In [34]:
# To create a new column age_group which is depends or based on the age column 

labels =['Young Adult','Adult','Middle-aged','Senior']
df['age_group']=pd.qcut(df['age'],q=4, labels=labels)

In [36]:
#To check the top 10 rows from the new columns age_group
df[['age','age_group']].head(10)

   age    age_group
0   55  Middle-aged
1   19  Young Adult
2   50  Middle-aged
3   21  Young Adult
4   45  Middle-aged
5   46  Middle-aged
6   63       Senior
7   27  Young Adult
8   26  Young Adult
9   57  Middle-aged

In [39]:
#To create a column purchace_frequency_days based/depend on the frequency_of_purchases


frequency_mapping = {
    'Fortnightly': 14,
    'Weekly': 7,
    'Monthly': 30,
    'Quarterly': 90,
    'Bi-Weekly': 14,
    'Annually': 365,
    'Every 3 Months': 90
}

df['purchase_frequency_days'] = df['frequency_of_purchases'].map(frequency_mapping)

In [40]:
#To check the top 10 rows from the new columns purchase_frequency_days
df[['purchase_frequency_days','frequency_of_purchases']].head(10)

   purchase_frequency_days frequency_of_purchases
0                       14            Fortnightly
1                       14            Fortnightly
2                        7                 Weekly
3                        7                 Weekly
4                      365               Annually
5                        7                 Weekly
6                       90              Quarterly
7                        7                 Weekly
8                      365               Annually
9                       90              Quarterly

In [43]:
#To check the dependancy between the discount_applied and promo_code_used 
# to want the discount then promocode will be used thats why teh columns records are same 

df[['discount_applied','promo_code_used']].head(10)

  discount_applied promo_code_used
0              Yes             Yes
1              Yes             Yes
2              Yes             Yes
3              Yes             Yes
4              Yes             Yes
5              Yes             Yes
6              Yes             Yes
7              Yes             Yes
8              Yes             Yes
9              Yes             Yes

In [55]:
#To check the discount_applied and promo_code_used  ll 
(df['discount_applied'] == df['promo_code_used']).all()

True

In [54]:
#To remove the column of promo_code_used because of the both  discount_applied and promo_code_used are the same columns

df = df.drop('promo_code_used', axis=1)

In [48]:

df.columns

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'previous_purchases', 'payment_method',
       'frequency_of_purchases', 'age_group', 'purchase_frequency_days'],
      dtype='object')

In [56]:


!pip install mysql-connector-python pandas

Requirement already satisfied: mysql-connector-python in c:\users\avi\appdata\roaming\python\python311\site-packages (8.4.0)
Requirement already satisfied: pandas in c:\users\avi\appdata\roaming\python\python311\site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\avi\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\avi\appdata\roaming\python\python311\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\avi\appdata\roaming\python\python311\site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in c:\users\avi\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

[notice] A new release of pip is available: 24.0 -> 26.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [66]:
pip show mysql-connector-python

Name: mysql-connector-python
Version: 8.4.0
Summary: MySQL driver written in Python
Home-page: http://dev.mysql.com/doc/connector-python/en/index.html
Author: Oracle and/or its affiliates
Author-email:
License: GNU GPLv2 (with FOSS License Exception)
Location: C:\Users\Avi\AppData\Roaming\Python\Python311\site-packages
Requires:
Required-by:
Note: you may need to restart the kernel to use updated packages.

In [58]:
import mysql.connector
import pandas as pd

In [59]:
#To check the connection is done or not 

try:
    conn = mysql.connector.connect(
        host="localhost",          # your host name, e.g., "localhost" or an IP address
        user="root",      # your MySQL username, e.g., "root"
        password="Avin@sh2003",  # your MySQL password
        database="customer_behaviour"   # the name of the specific database to use
    )
    print("Connection successful!")
except mysql.connector.Error as e:
    print(f"Error connecting to MySQL: {e}")

Connection successful!

In [62]:
!pip install pymysql

Collecting pymysql
  Downloading pymysql-1.1.2-py3-none-any.whl.metadata (4.3 kB)
Downloading pymysql-1.1.2-py3-none-any.whl (45 kB)
   ---------------------------------------- 0.0/45.3 kB ? eta -:--:--
   ---------------------------------------- 0.0/45.3 kB ? eta -:--:--
   ---------------------------------------- 0.0/45.3 kB ? eta -:--:--
   ---------------------------------------- 0.0/45.3 kB ? eta -:--:--
   ---------------------------------------- 0.0/45.3 kB ? eta -:--:--
   ------------------ --------------------- 20.5/45.3 kB ? eta -:--:--
   ------------------ --------------------- 20.5/45.3 kB ? eta -:--:--
   ------------------ --------------------- 20.5/45.3 kB ? eta -:--:--
   ------------------ --------------------- 20.5/45.3 kB ? eta -:--:--
   ------------------ --------------------- 20.5/45.3 kB ? eta -:--:--
   ---------------------------------------- 45.3/45.3 kB 149.2 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.2

[notice] A new release of pip is available: 24.0 -> 26.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [73]:
# Step 1 : Connect to mysql 

import pandas as pd
from sqlalchemy import create_engine
from urllib.parse import quote_plus

database_username = 'root'
database_password = quote_plus('Avin@sh2003')
database_ip = 'localhost' # or your host IP, e.g., '127.0.0.1'
database_name = 'customer_behaviour'
database_port = 3306 # default MySQL port


# Create the connection string
# Format: 'mysql+pymysql://user:password@host:port/dbname'
db_connection_str = f'mysql+pymysql://{database_username}:{database_password}@{database_ip}:{database_port}/{database_name}'
engine = create_engine(db_connection_str)

In [74]:
# Step 2 : load the dataframe into the mysql 

table_name = 'customer' # Name the new table in MySQL
df.to_sql(name=table_name, con=engine, if_exists='replace', index=False)
# if_exists options: 'fail', 'replace' (drops and recreates), 'append' (inserts data if table exists)

print(f"DataFrame successfully loaded into table '{table_name}' in MySQL database '{database_name}'.")

DataFrame successfully loaded into table 'customer' in MySQL database 'customer_behaviour'.